[
  {
    "name": "Anime4u",
    "website_url": "https://e-commerce-website-omega-six.vercel.app/",
    "github_url": "https://github.com/BilalSh10/e-commerce_website",
    "image": "/projectsImages/Anime4uScreenShot.png",
    "description": "A Full Stack e-commerce website that sells Anime products in the country, the main purpose of the website is to make money from selling these products. (Ready To Lunch).",
    "technologies": "Next Js, React, TypeScript, Shadcn, Tailwind css, Clerk, Stripe and MongoDB"
  },
  {
    "name": "Booking Flights Website",
    "website_url": "https://booking-flights-website.vercel.app/",
    "github_url": "https://github.com/BilalSh10/Booking_Flights_Website",
    "image": "/projectsImages/p1.png",
    "description": "My project is a A Full Stack website that provides low-price tickets for whom want to fly anywhere anytime, the website allows the users to search for the country that they want to fly to and shows the users popular flights that were booked by other people. Moreover, the user can book the flight from other websites that he loves like Kiwi, booking, and Skyscanner.",
    "technologies": "React, JavaScript, ant design, CSS, SkyScanner API and Firebase"
  },
  {
    "name": "Booking Events Website",
    "website_url": "https://teatro-369c1.web.app/",
    "github_url": "https://github.com/BilalSh10/Ekhtar-Al-Saadah",
    "image": "/projectsImages/p2.png",
    "description": "The aim of the project is to build a website that helps the association in administering the events it holds; it will manage the booking and cancellation of reservations. It will provide information to the visitor about the association, it’s past and upcoming events, it will offer the ability to contact it, subscribe to its mailing list to get notifications about upcoming events, and fill a donation form, as well as the ability to submit reviews.",
    "technologies": "React, JavaScript, CSS and Firebase"
  },
  {
    "name": "Pick random football team app",
    "website_url": "https://pick-random-team.netlify.app/",
    "github_url": "https://github.com/BilalSh10/RandomTeam",
    "image": "/projectsImages/project3.png",
    "description": "A website that allow users to pick random teams from a list of Big football teams with a score for each team and an input fields to allow them to put their name on it to make random teams between them the perpose of this project to let people to play fifa game with their friends and to challange them fairly.",
    "technologies": "Next Js, JavaScript and CSS"
  },
  {
    "name": "Shapley Value calculation",
    "website_url": "/",
    "github_url": "https://github.com/BilalSh10/Shapley_value",
    "image": "/projectsImages/shapley_value.png",
    "description": "I developed a web application that applies the Shapley Value from cooperative game theory, offering a more nuanced and fair assessment of player performance. The challenge I focused on was ensuring fair reward distribution in MOBA games by accurately recognizing each player's unique contributions.",
    "technologies": "Python, JavaScript, with Next.js for the frontend, Tailwind CSS and ShadCN for a sleek UI, and Flask"
  },
  {
    "name": "grandma take care reminder",
    "website_url": "https://t.me/grandma125_bot",
    "github_url": "https://github.com/grurniClasses/devboost1-telegram-bot-hackathon-team7",
    "image": "/projectsImages/telegram_bot_grandma.png",
    "description": " I had the pleasure of working with an amazing team of 4 talented developers. Together, we built a unique Telegram bot designed with a special purpose in mind: taking care of your grandma! 🧓❤️ Our bot sends reminders to family members to check in with their grandma, ensuring she never feels alone and always has someone to talk to. It's been a rewarding experience to create something that blends technology with compassion.",
    "technologies": "Python, and telebot library"
  }
]
